In [33]:
import pandas as pd

# Renaming Columns

In [34]:
# sample DataFrame
df = pd.DataFrame({
    "full name": ["Onkar", "Amit", "Sara"],
    "AGE (Years)": [21, 25, 23],
    "CITY_NAME": ["Pune", "Mumbai", "Nashik"]
})

df

  full name  AGE (Years) CITY_NAME
0     Onkar           21      Pune
1      Amit           25    Mumbai
2      Sara           23    Nashik

So above sample DataFrame have intentially given problamatic names like it has spaces, uppercase letters and symbols.

## 1. Rename one column - `.rename()`

In [35]:
df = df.rename(columns={"full name": "Name"})
df

    Name  AGE (Years) CITY_NAME
0  Onkar           21      Pune
1   Amit           25    Mumbai
2   Sara           23    Nashik

## 2. Rename multiple columns

In [36]:
df = df.rename(columns={
    "AGE (Years)": "Age",
    "CITY_NAME": "City"
})
df

    Name  Age    City
0  Onkar   21    Pune
1   Amit   25  Mumbai
2   Sara   23  Nashik

## 3. Rename inplace

In [37]:
df.rename(columns={"Name":"FullName"}, inplace=True)
df

  FullName  Age    City
0    Onkar   21    Pune
1     Amit   25  Mumbai
2     Sara   23  Nashik

In [38]:
df.columns

Index(['FullName', 'Age', 'City'], dtype='object')

## 4. Rename all columns at once

But in this we have to change or list all the column name.  
Like is there are 4 columns the list also contain 4 names no matter what

In [39]:
df.columns = ["Name","Age","CityName"]
df.columns

Index(['Name', 'Age', 'CityName'], dtype='object')

## 5. Auto-clean column names

In [42]:
# To clean first make it dirty
df.columns = ["Full Name", "Age (years)", " CITY"]
df.columns

Index(['Full Name', 'Age (years)', ' CITY'], dtype='object')

In [44]:
# Replacing spaces with underscore
df.columns = df.columns.str.replace(" ", "_")
df.columns

Index(['Full_Name', 'Age_(years)', '_CITY'], dtype='object')

In [45]:
# all lowercase
df.columns = df.columns.str.lower()
df.columns

Index(['full_name', 'age_(years)', '_city'], dtype='object')

## 6. Rename columns using .str methods (powerful)

In [51]:
# Making it dirty so we can make it clean at once
df.columns = ["Full Name", "AGE", "  City "]
df.columns

Index(['Full Name', 'AGE', '  City '], dtype='object')

In [50]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
df.columns

Index(['full_name', 'age', 'city'], dtype='object')

We strip first (removed leading and trailing spaces),  
Then lower the all letters,  
finally we replaced spaces with underscore.